InformationRegisters/упСкладскиеВоротаТочекРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСкладскиеВоротаТочекРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРаботы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладскиеВорота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСкладскиеВорота</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упМаршрутПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упМаршрутПоРейсу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременноеОкноНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременноеОкноОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияВТочке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияВТочкеПослеРабот</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтдыхаВПутиОтПредыдущейТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтПредыдущейТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПростояПоВинеЗаказчикаЧасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПростояПоВинеПеревозчикаЧасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРабот</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гараж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторИсходнойТочки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьАвторасчетУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеПрибытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеУбытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокУчастка</Name>
					<Comment>Участок объединяет точки маршрута. Изменение порядка объезда возможно только в пределах участка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предшественники</Name>
					<Comment>идентификаторы точек в маршруте, посещение которых перед текущей точкой является обязательным</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрибытиеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроездНеРассчитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасстояниеОтПредыдущейТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасстояниеОтПредыдущейТочкиФакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УбытиеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упСкладскиеВоротаТочекРейса/Forms/УстановкаСкладскихВорот/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Рейс") Или Не ЗначениеЗаполнено(Параметры.Рейс) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан рейс!'");
	КонецЕсли; 
	
	ЭтаФорма.Рейс = Параметры.Рейс;
	
	ОбновитьДанныеФормы();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МаршрутПриАктивизацииСтроки(Элемент)
	
	СтрокаТочка = Элемент.ТекущиеДанные;
	Если Не СтрокаТочка = Неопределено Тогда
		Элементы.СкладскиеВорота.ОтборСтрок = Новый ФиксированнаяСтруктура("Идентификатор", СтрокаТочка.Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладскиеВоротаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		текДанные = Элементы.Маршрут.ТекущиеДанные;
		
		текВорота = Элементы.СкладскиеВорота.ТекущиеДанные;
		текВорота.Идентификатор = текДанные.Идентификатор;
	КонецЕсли; 
	Модифицированность = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	ЗаписатьИзмененияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ЭтаФорма.Маршрут.Очистить();
	ЭтаФорма.СкладскиеВорота.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упМаршрутПоРейсуСрезПоследних.Идентификатор КАК Идентификатор,
	|	упМаршрутПоРейсуСрезПоследних.Адрес КАК Адрес,
	|	упМаршрутПоРейсуСрезПоследних.Адрес.Склад КАК Склад,
	|	упМаршрутПоРейсуСрезПоследних.ТипТочки КАК ТипТочки,
	|	упМаршрутПоРейсуСрезПоследних.СтрокаНомер КАК СтрокаНомер,
	|	упМаршрутПоРейсуСрезПоследних.Пройдена КАК Пройдена,
	|	упМаршрутПоРейсуСрезПоследних.Отменена КАК Отменена,
	|	упМаршрутПоРейсуСрезПоследних.Отложена КАК Отложена,
	|	упМаршрутПоРейсуСрезПоследних.ТипТочки.Порядок КАК ИндексКартинки
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(, Рейс = &Рейс) КАК упМаршрутПоРейсуСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	упМаршрутПоРейсуСрезПоследних.СтрокаНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упСкладскиеВоротаТочекРейса.Идентификатор КАК Идентификатор,
	|	упСкладскиеВоротаТочекРейса.ИдентификаторРаботы КАК ИдентификаторРаботы,
	|	упСкладскиеВоротаТочекРейса.СкладскиеВорота КАК СкладскиеВорота,
	|	упСкладскиеВоротаТочекРейса.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.упСкладскиеВоротаТочекРейса КАК упСкладскиеВоротаТочекРейса
	|ГДЕ
	|	упСкладскиеВоротаТочекРейса.Рейс = &Рейс
	|
	|УПОРЯДОЧИТЬ ПО
	|	упСкладскиеВоротаТочекРейса.Идентификатор,
	|	упСкладскиеВоротаТочекРейса.СкладскиеВорота";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоТаблиц = РезультатЗапроса.Количество();
	
	Если Не РезультатЗапроса[КоличествоТаблиц - 2].Пустой() Тогда
		ВыборкаМаршрут = РезультатЗапроса[КоличествоТаблиц - 2].Выбрать();
		Пока ВыборкаМаршрут.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Маршрут.Добавить(), ВыборкаМаршрут);
		КонецЦикла; 
	КонецЕсли;
	
	Если Не РезультатЗапроса[КоличествоТаблиц - 1].Пустой() Тогда
		ВыборкаВорота = РезультатЗапроса[КоличествоТаблиц - 1].Выбрать();
		Пока ВыборкаВорота.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СкладскиеВорота.Добавить(), ВыборкаВорота);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСкладскиеВоротаТочекРейса");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	
	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Рейс, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.упСкладскиеВоротаТочекРейса.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Рейс.Установить(Рейс);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого текВорота Из СкладскиеВорота Цикл
		Если ЗначениеЗаполнено(текВорота.Идентификатор) И ЗначениеЗаполнено(текВорота.СкладскиеВорота) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Рейс = Рейс;
			НоваяЗапись.Идентификатор = текВорота.Идентификатор;
			НоваяЗапись.СкладскиеВорота = текВорота.СкладскиеВорота;
			НоваяЗапись.Комментарий     = текВорота.Комментарий;
		КонецЕсли; 
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	Иначе	
	     ЗафиксироватьТранзакцию();
	 КонецЕсли; 
	 
	 Модифицированность = Ложь;
	
КонецПроцедуры	

#КонецОбласти
